vortex314/projects/STM32F103-USB/stm32/hw_config.c
/**
 ******************************************************************************
 * @file    hw_config.c
 * @author  MCD Application Team
 * @version V4.0.0
 * @date    21-January-2013
 * @brief   Hardware Configuration & Setup
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
 *
 * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at:
 *
 *        http://www.st.com/software_license_agreement_liberty_v2
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/

#include "stm32_it.h"
#include "usb_lib.h"
#include "usb_prop.h"
#include "usb_desc.h"
#include "hw_config.h"
#include "usb_pwr.h"

#include "Usb.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
ErrorStatus HSEStartUpStatus;
// USART_InitTypeDef USART_InitStructure;
EXTI_InitTypeDef EXTI_InitStructure;
// uint8_t  USART_Rx_Buffer [USART_RX_DATA_SIZE];
// uint32_t USART_Rx_ptr_in = 0;
// uint32_t USART_Rx_ptr_out = 0;
// uint32_t USART_Rx_length  = 0;

uint8_t USB_Tx_State = 0;
static void IntToUnicode(uint32_t value, uint8_t *pbuf, uint8_t len);
/* Extern variables ----------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
#include <stdint.h>
extern uint64_t getSysUpTime();

void sleep(uint32_t msec) {
	uint64_t start = getSysUpTime();
	uint64_t end = start + msec;
	while (getSysUpTime() < end)
		;
}

inline bool isInterrupt() {
	return (SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) != 0;
}
#include "usb_pwr.h"

void resumeUsb() {
	Resume(RESUME_INTERNAL);
}
void initBoard() {
//	SystemInit();
	SysTick_Config(SystemCoreClock / 1000);
	sleep(10);
	USB_Cable_Config(DISABLE);
	sleep(10);
	USB_Cable_Config(ENABLE);
	Set_System();
	Set_USBClock();
	USB_Interrupts_Config();
	USB_Init();

}
/*******************************************************************************
 * Function Name  : Set_System
 * Description    : Configures Main system clocks & power
 * Input          : None.
 * Return         : None.
 *******************************************************************************/
void Set_System(void) {
#if !defined(STM32L1XX_MD) && !defined(STM32L1XX_HD) && !defined(STM32L1XX_MD_PLUS)
//  GPIO_InitTypeDef GPIO_InitStructure;
#endif /* STM32L1XX_MD && STM32L1XX_XD */  

#if defined(USB_USE_EXTERNAL_PULLUP)
	GPIO_InitTypeDef GPIO_InitStructure;
#endif /* USB_USE_EXTERNAL_PULLUP */ 

	/*!< At this stage the microcontroller clock setting is already configured,
	 this is done through SystemInit() function which is called from startup
	 file (startup_stm32f10x_xx.s) before to branch to application main.
	 To reconfigure the default setting of SystemInit() function, refer to
	 system_stm32f10x.c file
	 */
#if defined(STM32L1XX_MD) || defined(STM32L1XX_HD)|| defined(STM32L1XX_MD_PLUS) || defined(STM32F37X) || defined(STM32F30X)
	/* Enable the SYSCFG module clock */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
#endif /* STM32L1XX_XD */ 

#if !defined(STM32L1XX_MD) && !defined(STM32L1XX_HD) && !defined(STM32L1XX_MD_PLUS) && !defined(STM32F37X) && !defined(STM32F30X)
	/* Enable USB_DISCONNECT GPIO clock */
	// RCC_AHBPeriphClockCmd(RCC_APB2Periph_GPIO_DISCONNECT, ENABLE);
	/* Configure USB pull-up pin */
	GPIO_InitStructure.GPIO_Pin = USB_DISCONNECT_PIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
//  GPIO_Init(USB_DISCONNECT, &GPIO_InitStructure);
#endif /* STM32L1XX_MD && STM32L1XX_XD */

#if defined(USB_USE_EXTERNAL_PULLUP)
	/* Enable the USB disconnect GPIO clock */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_DISCONNECT, ENABLE);

	/* USB_DISCONNECT used as USB pull-up */
	GPIO_InitStructure.GPIO_Pin = USB_DISCONNECT_PIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(USB_DISCONNECT, &GPIO_InitStructure);
#endif /* USB_USE_EXTERNAL_PULLUP */ 

#if defined(STM32F37X) || defined(STM32F30X)

	/* Enable the USB disconnect GPIO clock */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIO_DISCONNECT, ENABLE);

	/*Set PA11,12 as IN - USB_DM,DP*/
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11 | GPIO_Pin_12;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/*SET PA11,12 for USB: USB_DM,DP*/
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource11, GPIO_AF_14);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource12, GPIO_AF_14);

	/* USB_DISCONNECT used as USB pull-up */
	GPIO_InitStructure.GPIO_Pin = USB_DISCONNECT_PIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(USB_DISCONNECT, &GPIO_InitStructure);
#endif /* STM32F37X && STM32F30X */ 

	/* Configure the EXTI line 18 connected internally to the USB IP */
	EXTI_ClearITPendingBit(EXTI_Line18);
	EXTI_InitStructure.EXTI_Line = EXTI_Line18;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);
}

/*******************************************************************************
 * Function Name  : Set_USBClock
 * Description    : Configures USB Clock input (48MHz)
 * Input          : None.
 * Return         : None.
 *******************************************************************************/
void Set_USBClock(void) {
#if defined(STM32L1XX_MD) || defined(STM32L1XX_HD) || defined(STM32L1XX_MD_PLUS) 
	/* Enable USB clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USB, ENABLE);

#else 
	/* Select USBCLK source */
	RCC_USBCLKConfig(RCC_USBCLKSource_PLLCLK_1Div5);

	/* Enable the USB clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USB, ENABLE);
#endif /* STM32L1XX_MD */
}

/*******************************************************************************
 * Function Name  : Enter_LowPowerMode
 * Description    : Power-off system clocks and power while entering suspend mode
 * Input          : None.
 * Return         : None.
 *******************************************************************************/
void Enter_LowPowerMode(void) {
	/* Set the device state to suspend */
	bDeviceState = SUSPENDED;
}

/*******************************************************************************
 * Function Name  : Leave_LowPowerMode
 * Description    : Restores system clocks and power while exiting suspend mode
 * Input          : None.
 * Return         : None.
 *******************************************************************************/
void Leave_LowPowerMode(void) {
	DEVICE_INFO *pInfo = &Device_Info;

	/* Set the device state to the correct state */
	if (pInfo->Current_Configuration != 0) {
		/* Device configured */
		bDeviceState = CONFIGURED;
	} else {
		bDeviceState = ATTACHED;
	}
	/*Enable SystemCoreClock*/
	SystemInit();
}

/*******************************************************************************
 * Function Name  : USB_Interrupts_Config
 * Description    : Configures the USB interrupts
 * Input          : None.
 * Return         : None.
 *******************************************************************************/
void USB_Interrupts_Config(void) {
	NVIC_InitTypeDef NVIC_InitStructure;

	/* 2 bit for pre-emption priority, 2 bits for subpriority */
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

#if defined(STM32L1XX_MD) || defined(STM32L1XX_HD)|| defined(STM32L1XX_MD_PLUS)
	NVIC_InitStructure.NVIC_IRQChannel = USB_LP_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* Enable the USB Wake-up interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USB_FS_WKUP_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

#elif defined(STM32F37X)
	/* Enable the USB interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USB_LP_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* Enable the USB Wake-up interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USBWakeUp_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

#else
	NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* Enable the USB Wake-up interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USBWakeUp_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_Init(&NVIC_InitStructure);
#endif /* STM32L1XX_XD */

	/* Enable USART Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = EVAL_COM1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
}

/*******************************************************************************
 * Function Name  : USB_Cable_Config
 * Description    : Software Connection/Disconnection of USB Cable
 * Input          : None.
 * Return         : Status
 *******************************************************************************/
#define MAPLE
// #define MINIMAL_BOARD

void USB_Cable_Config(FunctionalState NewState) {
#if defined(STM32L1XX_MD) || defined (STM32L1XX_HD)|| (STM32L1XX_MD_PLUS)
	if (NewState != DISABLE)
	{
		STM32L15_USB_CONNECT;
	}
	else
	{
		STM32L15_USB_DISCONNECT;
	}

#elif defined(MINIMAL_BOARD)/* USE_STM3210B_EVAL or USE_STM3210E_EVAL */
	GPIO_InitTypeDef GPIO_InitStructure;
	if (NewState != DISABLE) {
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_DISCONNECT, ENABLE);

		/* USB_DISCONNECT used as USB pull-up */
		GPIO_InitStructure.GPIO_Pin = USB_DISCONNECT_PIN;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_Init(USB_DISCONNECT, &GPIO_InitStructure);
		GPIO_SetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
	} else {
		/* USB_DISCONNECT used as USB floating */
		GPIO_InitStructure.GPIO_Pin = USB_DISCONNECT_PIN;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
		GPIO_Init(USB_DISCONNECT, &GPIO_InitStructure);
		GPIO_ResetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
	}
#elif defined(MAPLE) /* STM32L1XX_MD */
	GPIO_InitTypeDef GPIO_InitStructure;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	if (NewState == DISABLE) {
		/* USB_DISCONNECT used as USB pull-up */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		GPIO_SetBits(GPIOB, GPIO_Pin_9);
	} else {
		/* USB_DISCONNECT used as USB pull_down */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_Init(USB_DISCONNECT, &GPIO_InitStructure);
		GPIO_ResetBits(GPIOB, GPIO_Pin_9);
	}
#endif
}

/*******************************************************************************
 * Function Name  :  USART_Config_Default.
 * Description    :  configure the EVAL_COM1 with default values.
 * Input          :  None.
 * Return         :  None.
 *******************************************************************************
 void USART_Config_Default(void)
 {
 // EVAL_COM1 default configuration *
 // EVAL_COM1 configured as follow:
 //      - BaudRate = 9600 baud
 //     - Word Length = 8 Bits
 //    - One Stop Bit
 //      - Parity Odd
 //      - Hardware flow control disabled
 //      - Receive and transmit enabled

 USART_InitStructure.USART_BaudRate = 9600;
 USART_InitStructure.USART_WordLength = USART_WordLength_8b;
 USART_InitStructure.USART_StopBits = USART_StopBits_1;
 USART_InitStructure.USART_Parity = USART_Parity_Odd;
 USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
 USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

 // Configure and enable the USART
 STM_EVAL_COMInit(COM1, &USART_InitStructure);

 // Enable the USART Receive interrupt
 USART_ITConfig(EVAL_COM1, USART_IT_RXNE, ENABLE);
 } */

/*******************************************************************************
 * Function Name  :  USART_Config.
 * Description    :  Configure the EVAL_COM1 according to the line coding structure.
 * Input          :  None.
 * Return         :  Configuration status
 TRUE : configuration done with success
 FALSE : configuration aborted.
 *******************************************************************************
 bool USART_Config(void)
 {

 // set the Stop bit
 switch (linecoding.format)
 {
 case 0:
 USART_InitStructure.USART_StopBits = USART_StopBits_1;
 break;
 case 1:
 USART_InitStructure.USART_StopBits = USART_StopBits_1_5;
 break;
 case 2:
 USART_InitStructure.USART_StopBits = USART_StopBits_2;
 break;
 default :
 {
 USART_Config_Default();
 return (FALSE);
 }
 }

 // set the parity bit
 switch (linecoding.paritytype)
 {
 case 0:
 USART_InitStructure.USART_Parity = USART_Parity_No;
 break;
 case 1:
 USART_InitStructure.USART_Parity = USART_Parity_Even;
 break;
 case 2:
 USART_InitStructure.USART_Parity = USART_Parity_Odd;
 break;
 default :
 {
 USART_Config_Default();
 return (FALSE);
 }
 }

 // set the data type : only 8bits and 9bits is supported
 switch (linecoding.datatype)
 {
 case 0x07:
 // With this configuration a parity (Even or Odd) should be set
 USART_InitStructure.USART_WordLength = USART_WordLength_8b;
 break;
 case 0x08:
 if (USART_InitStructure.USART_Parity == USART_Parity_No)
 {
 USART_InitStructure.USART_WordLength = USART_WordLength_8b;
 }
 else
 {
 USART_InitStructure.USART_WordLength = USART_WordLength_9b;
 }

 break;
 default :
 {
 USART_Config_Default();
 return (FALSE);
 }
 }

 USART_InitStructure.USART_BaudRate = linecoding.bitrate;
 USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
 USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
 
 // Configure and enable the USART
 STM_EVAL_COMInit(COM1, &USART_InitStructure);

 return (TRUE);
 }*/

/*******************************************************************************
 * Function Name  : USB_To_USART_Send_Data.
 * Description    : send the received data from USB to the UART 0.
 * Input          : data_buffer: data address.
 Nb_bytes: number of bytes to send.
 * Return         : none.
 *******************************************************************************/
/*void USB_To_USART_Send_Data(uint8_t* data_buffer, uint8_t Nb_bytes)
 {

 uint32_t i;

 for (i = 0; i < Nb_bytes; i++)
 {
 USART_SendData(EVAL_COM1, *(data_buffer + i));
 while(USART_GetFlagStatus(EVAL_COM1, USART_FLAG_TXE) == RESET);
 }
 }*/

/*******************************************************************************
 * Function Name  : Handle_USBAsynchXfer.
 * Description    : send data to USB.
 * Input          : None.
 * Return         : none.
 *******************************************************************************/
void Handle_USBAsynchXfer(void) {

//  uint16_t USB_Tx_ptr;
	uint16_t USB_Tx_length;

	if (usbTxDataSize() == 0) {
		USB_Tx_State = 0;
		return;
	}
	USB_Tx_length = usbTxDataSize();
	if (USB_Tx_length > VIRTUAL_COM_PORT_DATA_SIZE) {
		USB_Tx_length = VIRTUAL_COM_PORT_DATA_SIZE;
	}

	USB_Tx_State = 1;
	uint8_t buffer[VIRTUAL_COM_PORT_DATA_SIZE];
	usbGetTxData(buffer, USB_Tx_length);
	UserToPMABufferCopy(buffer, ENDP1_TXADDR, USB_Tx_length);
	SetEPTxCount(ENDP1, USB_Tx_length);
	SetEPTxValid(ENDP1);
}
/*******************************************************************************
 * Function Name  : UART_To_USB_Send_Data.
 * Description    : send the received data from UART 0 to USB.
 * Input          : None.
 * Return         : none.
 *******************************************************************************/
/* void USART_To_USB_Send_Data(void)
 {

 if (linecoding.datatype == 7)
 {
 USART_Rx_Buffer[USART_Rx_ptr_in] = USART_ReceiveData(EVAL_COM1) & 0x7F;
 }
 else if (linecoding.datatype == 8)
 {
 USART_Rx_Buffer[USART_Rx_ptr_in] = USART_ReceiveData(EVAL_COM1);
 }

 USART_Rx_ptr_in++;

 // To avoid buffer overflow
 if(USART_Rx_ptr_in == USART_RX_DATA_SIZE)
 {
 USART_Rx_ptr_in = 0;
 }
 }*/

/*******************************************************************************
 * Function Name  : Get_SerialNum.
 * Description    : Create the serial number string descriptor.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void Get_SerialNum(void) {
	uint32_t Device_Serial0, Device_Serial1, Device_Serial2;

	Device_Serial0 = *(uint32_t*) ID1;
	Device_Serial1 = *(uint32_t*) ID2;
	Device_Serial2 = *(uint32_t*) ID3;

	Device_Serial0 += Device_Serial2;

	if (Device_Serial0 != 0) {
		IntToUnicode(Device_Serial0, &Virtual_Com_Port_StringSerial[2], 8);
		IntToUnicode(Device_Serial1, &Virtual_Com_Port_StringSerial[18], 4);
	}
}

/*******************************************************************************
 * Function Name  : HexToChar.
 * Description    : Convert Hex 32Bits value into char.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
static void IntToUnicode(uint32_t value, uint8_t *pbuf, uint8_t len) {
	uint8_t idx = 0;

	for (idx = 0; idx < len; idx++) {
		if (((value >> 28)) < 0xA) {
			pbuf[2 * idx] = (value >> 28) + '0';
		} else {
			pbuf[2 * idx] = (value >> 28) + 'A' - 10;
		}

		value = value << 4;

		pbuf[2 * idx + 1] = 0;
	}
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
